[{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fcd"
  },
  "title": "Battenberg Cake",
  "category": "Dessert",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "British",
  "instructions": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
  "description": "A classic British cake made with almond sponge cake and covered with marzipan. It is traditionally pink and yellow checkered in appearance.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Battenberg%20Cake.jpg",
  "time": "60",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e367e",
      "measure": "175g"
    },
    {
      "id": "640c2dd963a319ea671e3687",
      "measure": "175g"
    },
    {
      "id": "640c2dd963a319ea671e3762",
      "measure": "140g"
    },
    {
      "id": "640c2dd963a319ea671e3814",
      "measure": "50g"
    },
    {
      "id": "640c2dd963a319ea671e3665",
      "measure": "½ tsp"
    },
    {
      "id": "640c2dd963a319ea671e36ca",
      "measure": "3 Medium"
    },
    {
      "id": "640c2dd963a319ea671e3786",
      "measure": "½ tsp"
    },
    {
      "id": "640c2dd963a319ea671e3861",
      "measure": "¼ teaspoon"
    },
    {
      "id": "640c2dd963a319ea671e380f",
      "measure": "½ tsp"
    },
    {
      "id": "640c2dd963a319ea671e37bf",
      "measure": "200g"
    },
    {
      "id": "640c2dd963a319ea671e3813",
      "measure": "1kg"
    },
    {
      "id": "640c2dd963a319ea671e379d",
      "measure": "Dusting"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733243"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1709506071976"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fbc"
  },
  "title": "Irish stew",
  "category": "Beef",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Irish",
  "instructions": "Heat the oven to 180C/350F/gas mark 4. Drain and rinse the soaked wheat, put it in a medium pan with lots of water, bring to a boil and simmer for an hour, until cooked. Drain and set aside.\r\n\r\nSeason the lamb with a teaspoon of salt and some black pepper. Put one tablespoon of oil in a large, deep sauté pan for which you have a lid; place on a medium-high heat. Add some of the lamb – don't overcrowd the pan – and sear for four minutes on all sides. Transfer to a bowl, and repeat with the remaining lamb, adding oil as needed.\r\n\r\nLower the heat to medium and add a tablespoon of oil to the pan. Add the shallots and fry for four minutes, until caramelised. Tip these into the lamb bowl, and repeat with the remaining vegetables until they are all nice and brown, adding more oil as you need it.\r\n\r\nOnce all the vegetables are seared and removed from the pan, add the wine along with the sugar, herbs, a teaspoon of salt and a good grind of black pepper. Boil on a high heat for about three minutes.\r\n\r\nTip the lamb, vegetables and whole wheat back into the pot, and add the stock. Cover and boil for five minutes, then transfer to the oven for an hour and a half.\r\n\r\nRemove the stew from the oven and check the liquid; if there is a lot, remove the lid and boil for a few minutes.",
  "description": "A traditional Irish dish made with lamb, potatoes, carrots, onions, and herbs, cooked in a broth or gravy.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Irish%20stew.jpg",
  "time": "160",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e3796",
      "measure": "300g soaked overnight in water"
    },
    {
      "id": "640c2dd963a319ea671e370c",
      "measure": "2kg cut into 3cm cubes"
    },
    {
      "id": "640c2dd963a319ea671e372c",
      "measure": "120ml"
    },
    {
      "id": "640c2dd963a319ea671e3765",
      "measure": "24 Skinned"
    },
    {
      "id": "640c2dd963a319ea671e3684",
      "measure": "4 large"
    },
    {
      "id": "640c2dd963a319ea671e3784",
      "measure": "2"
    },
    {
      "id": "640c2dd963a319ea671e3689",
      "measure": "1"
    },
    {
      "id": "640c2dd963a319ea671e368d",
      "measure": "350g"
    },
    {
      "id": "640c2dd963a319ea671e3794",
      "measure": "150ml"
    },
    {
      "id": "640c2dd963a319ea671e3687",
      "measure": "1 tsp"
    },
    {
      "id": "640c2dd963a319ea671e36de",
      "measure": "4 sprigs"
    },
    {
      "id": "640c2dd963a319ea671e3731",
      "measure": "4 sprigs"
    },
    {
      "id": "640c2dd963a319ea671e3696",
      "measure": "450ml"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733240"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1706220769038"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd2889800c"
  },
  "title": "Lancashire hotpot",
  "category": "Lamb",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "British",
  "instructions": "Heat oven to 160C/fan 140C/gas 3. Heat some dripping or butter in a large shallow casserole dish, brown the lamb in batches, lift to a plate, then repeat with the kidneys.\r\nFry the onions and carrots in the pan with a little more dripping until golden. Sprinkle over the flour, allow to cook for a couple of mins, shake over the Worcestershire sauce, pour in the stock, then bring to the boil. Stir in the meat and bay leaves, then turn off the heat. Arrange the sliced potatoes on top of the meat, then drizzle with a little more dripping. Cover, then place in the oven for about 1½ hrs until the potatoes are cooked.\r\nRemove the lid, brush the potatoes with a little more dripping, then turn the oven up to brown the potatoes, or finish under the grill for 5-8 mins until brown.",
  "description": "A hearty casserole with tender lamb and vegetables, topped with sliced potatoes.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Lancashire%20hotpot.jpg",
  "time": "115",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e367e",
      "measure": "100g "
    },
    {
      "id": "640c2dd963a319ea671e370b",
      "measure": "900g"
    },
    {
      "id": "640c2dd963a319ea671e3801",
      "measure": "3"
    },
    {
      "id": "640c2dd963a319ea671e372e",
      "measure": "2 medium"
    },
    {
      "id": "640c2dd963a319ea671e3684",
      "measure": "4 sliced"
    },
    {
      "id": "640c2dd963a319ea671e3743",
      "measure": "25g"
    },
    {
      "id": "640c2dd963a319ea671e3798",
      "measure": "2 tsp"
    },
    {
      "id": "640c2dd963a319ea671e3696",
      "measure": "500ml"
    },
    {
      "id": "640c2dd963a319ea671e366b",
      "measure": "2"
    },
    {
      "id": "640c2dd963a319ea671e3746",
      "measure": "900g"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733242"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1701383864274"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fbf"
  },
  "title": "Teriyaki Chicken Casserole",
  "category": "Chicken",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Japanese",
  "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
  "description": "A Japanese-inspired casserole made with chicken, teriyaki sauce, rice, and vegetables.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Teriyaki%20Chicken%20Casserole.jpg",
  "time": "75",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e376c",
      "measure": "3/4 cup"
    },
    {
      "id": "640c2dd963a319ea671e378f",
      "measure": "1/2 cup"
    },
    {
      "id": "640c2dd963a319ea671e367d",
      "measure": "1/4 cup"
    },
    {
      "id": "640c2dd963a319ea671e36f8",
      "measure": "1/2 teaspoon"
    },
    {
      "id": "640c2dd963a319ea671e3720",
      "measure": "1/2 teaspoon"
    },
    {
      "id": "640c2dd963a319ea671e36b3",
      "measure": "4 Tablespoons"
    },
    {
      "id": "640c2dd963a319ea671e3694",
      "measure": "2"
    },
    {
      "id": "640c2dd963a319ea671e3772",
      "measure": "1 (12 oz.)"
    },
    {
      "id": "640c2dd963a319ea671e367c",
      "measure": "3 cups"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733240"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1706301557199"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fc3"
  },
  "title": "Honey Teriyaki Salmon",
  "category": "Seafood",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Japanese",
  "instructions": "Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.\r\n\r\nHeat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.\r\n\r\nGarnish with sesame and serve immediately.",
  "description": "A Japanese-inspired dish made with salmon fillets, teriyaki sauce, honey, and sesame seeds.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Honey%20Teriyaki%20Salmon.jpg",
  "time": "25",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e365c",
      "measure": "1 lb"
    },
    {
      "id": "640c2dd963a319ea671e372c",
      "measure": "1 tablespoon"
    },
    {
      "id": "640c2dd963a319ea671e376c",
      "measure": "2 tablespoons"
    },
    {
      "id": "640c2dd963a319ea671e375c",
      "measure": "2 tablespoons"
    },
    {
      "id": "640c2dd963a319ea671e3764",
      "measure": "4 tablespoons"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733240"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1704918409835"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28898019"
  },
  "title": "Poutine",
  "category": "Miscellaneous",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Canadian",
  "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C).\r\nWarm gravy in saucepan or microwave.\r\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes.\r\nRemove to a paper towel lined plate to drain.\r\nPlace the fries on a serving platter, and sprinkle the cheese over them.\r\nLadle gravy over the fries and cheese, and serve immediately.",
  "description": "A Canadian dish made with french fries, cheese curds, and gravy.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Poutine.jpg",
  "time": "20",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e3789",
      "measure": "Dash"
    },
    {
      "id": "640c2dd963a319ea671e366e",
      "measure": "1 Can"
    },
    {
      "id": "640c2dd963a319ea671e3746",
      "measure": "5 thin cut"
    },
    {
      "id": "640c2dd963a319ea671e3690",
      "measure": "2 cups"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733240"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1700580532671"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fbd"
  },
  "title": "Bakewell tart",
  "category": "Dessert",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "British",
  "instructions": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.",
  "description": "A British dessert consisting of a shortcrust pastry shell filled with raspberry jam, frangipane, and topped with almonds.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Bakewell%20tart.jpg",
  "time": "85",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e3743",
      "measure": "175g/6oz"
    },
    {
      "id": "640c2dd963a319ea671e369a",
      "measure": "75g/2½oz"
    },
    {
      "id": "640c2dd963a319ea671e36ad",
      "measure": "2-3 tbsp"
    },
    {
      "id": "640c2dd963a319ea671e3749",
      "measure": "1 tbsp"
    },
    {
      "id": "640c2dd963a319ea671e367e",
      "measure": "125g/4½oz"
    },
    {
      "id": "640c2dd963a319ea671e3687",
      "measure": "125g/4½oz"
    },
    {
      "id": "640c2dd963a319ea671e36f6",
      "measure": "125g/4½oz"
    },
    {
      "id": "640c2dd963a319ea671e36da",
      "measure": "1"
    },
    {
      "id": "640c2dd963a319ea671e3861",
      "measure": "½ tsp"
    },
    {
      "id": "640c2dd963a319ea671e36d5",
      "measure": "50g/1¾oz"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733239"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1699098827388"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28898054"
  },
  "title": "Callaloo Jamaican Style",
  "category": "Miscellaneous",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Jamaican",
  "instructions": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
  "description": "A traditional Jamaican dish made with callaloo leaves and a variety of spices. Served with rice and peas.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Callaloo%20Jamaican%20Style.jpg",
  "time": "30",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e3707",
      "measure": "1  bunch"
    },
    {
      "id": "640c2dd963a319ea671e3664",
      "measure": "2 strips"
    },
    {
      "id": "640c2dd963a319ea671e36e3",
      "measure": "3 cloves Chopped"
    },
    {
      "id": "640c2dd963a319ea671e37ae",
      "measure": "1 medium"
    },
    {
      "id": "640c2dd963a319ea671e3733",
      "measure": "1/2 tsp"
    },
    {
      "id": "640c2dd963a319ea671e377c",
      "measure": "1 Sprig"
    },
    {
      "id": "640c2dd963a319ea671e37af",
      "measure": "1"
    },
    {
      "id": "640c2dd963a319ea671e374f",
      "measure": "1"
    },
    {
      "id": "640c2dd963a319ea671e37d4",
      "measure": "4"
    },
    {
      "id": "640c2dd963a319ea671e3789",
      "measure": "Splash"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733244"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1701539235567"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897fd4"
  },
  "title": "Beef Brisket Pot Roast",
  "category": "Beef",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "American",
  "instructions": "1 Prepare the brisket for cooking: On one side of the brisket there should be a layer of fat, which you want. If there are any large chunks of fat, cut them off and discard them. Large pieces of fat will not be able to render out completely.\r\nUsing a sharp knife, score the fat in parallel lines, about 3/4-inch apart. Slice through the fat, not the beef. Repeat in the opposite direction to make a cross-hatch pattern.\r\nSalt the brisket well and let it sit at room temperature for 30 minutes.\r\n \r\n2 Sear the brisket: You'll need an oven-proof, thick-bottomed pot with a cover, or Dutch oven, that is just wide enough to hold the brisket roast with a little room for the onions.\r\nPat the brisket dry and place it, fatty side down, into the pot and place it on medium high heat. Cook for 5-8 minutes, lightly sizzling, until the fat side is nicely browned. (If the roast seems to be cooking too fast, turn the heat down to medium. You want a steady sizzle, not a raging sear.)\r\nTurn the brisket over and cook for a few minutes more to brown the other side.\r\n\r\n3 Sauté the onions and garlic: When the brisket has browned, remove it from the pot and set aside. There should be a couple tablespoons of fat rendered in the pot, if not, add some olive oil.\r\nAdd the chopped onions and increase the heat to high. Sprinkle a little salt on the onions. Sauté, stirring often, until the onions are lightly browned, 5-8 minutes. Stir in the garlic and cook 1-2 more minutes.\r\n \r\n4 Return brisket to pot, add herbs, stock, bring to simmer, cover, cook in oven: Preheat the oven to 300°F. Use kitchen twine to tie together the bay leaves, rosemary and thyme.\r\nMove the onions and garlic to the sides of the pot and nestle the brisket inside. Add the beef stock and the tied-up herbs. Bring the stock to a boil on the stovetop.\r\nCover the pot, place the pot in the 300°F oven and cook for 3 hours. Carefully flip the brisket every hour so it cooks evenly.\r\n \r\n5 Add carrots, continue to cook: After 3 hours, add the carrots. Cover the pot and cook for 1 hour more, or until the carrots are cooked through and the brisket is falling-apart tender.\r\n6 Remove brisket to cutting board, tent with foil: When the brisket is falling-apart tender, take the pot out of the oven and remove the brisket to a cutting board. Cover it with foil. Pull out and discard the herbs.\r\n7 Make sauce (optional): At this point you have two options. You can serve as is, or you can make a sauce with the drippings and some of the onions. If you serve as is, skip this step.\r\nTo make a sauce, remove the carrots and half of the onions, set aside and cover them with foil. Pour the ingredients that are remaining into the pot into a blender, and purée until smooth. If you want, add 1 tablespoon of mustard to the mix. Put into a small pot and keep warm.\r\n8 Slice the meat across the grain: Notice the lines of the muscle fibers of the roast. This is the \"grain\" of the meat. Slice the meat perpendicular to these lines, or across the grain (cutting this way further tenderizes the meat), in 1/4-inch to 1/2-inch slices.\r\nServe with the onions, carrots and gravy. Serve with mashed, roasted or boiled potatoes, egg noodles or polenta.",
  "description": "A comforting American dish of beef brisket slow-cooked with root vegetables and herbs until tender and flavorful.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Beef%20Brisket%20Pot%20Roast.jpg",
  "time": "300",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e366c",
      "measure": "4-5 pound"
    },
    {
      "id": "640c2dd963a319ea671e375e",
      "measure": "Dash"
    },
    {
      "id": "640c2dd963a319ea671e37ae",
      "measure": "3"
    },
    {
      "id": "640c2dd963a319ea671e36e3",
      "measure": "5 cloves"
    },
    {
      "id": "640c2dd963a319ea671e377c",
      "measure": "1 Sprig"
    },
    {
      "id": "640c2dd963a319ea671e37cb",
      "measure": "1 sprig "
    },
    {
      "id": "640c2dd963a319ea671e366b",
      "measure": "4"
    },
    {
      "id": "640c2dd963a319ea671e366f",
      "measure": "2 cups"
    },
    {
      "id": "640c2dd963a319ea671e3684",
      "measure": "3 Large"
    },
    {
      "id": "640c2dd963a319ea671e3727",
      "measure": "1 Tbsp"
    },
    {
      "id": "640c2dd963a319ea671e3746",
      "measure": "4 Mashed"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733241"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1697620698842"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd2889806d"
  },
  "title": "Rogaliki (Polish Croissant Cookies)",
  "category": "Dessert",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Polish",
  "instructions": "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.\r\nCreate a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.\r\nTake the dough out and separate into two. Roll and cut out 3 inch trangles.\r\nMake as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.\r\nPlace the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.\r\nRepeat with the rest of the dough.\r\nWhen you take them out, put aside and sprinkle with powdered sugar on top.\r\nThis makes about 3 batches of 20 cookies each.\r\nTotal count about 60 cookies.",
  "description": "A popular Polish pastry, Rogaliki are crescent-shaped cookies made from a flaky, buttery dough and typically filled with jam, nuts, or poppy seeds.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Rogaliki%20_Polish%20Croissant%20Cookies_.jpg",
  "time": "35",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e367e",
      "measure": "1 cup "
    },
    {
      "id": "640c2dd963a319ea671e36c9",
      "measure": "3"
    },
    {
      "id": "640c2dd963a319ea671e379c",
      "measure": "8 oz "
    },
    {
      "id": "640c2dd963a319ea671e3665",
      "measure": "1 tsp "
    },
    {
      "id": "640c2dd963a319ea671e36d7",
      "measure": "3 cups "
    },
    {
      "id": "640c2dd963a319ea671e3890",
      "measure": "1 Jar"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733247"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1699370269867"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28897ff4"
  },
  "title": "Thai Green Curry",
  "category": "Chicken",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Thai",
  "instructions": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side.\r\nIn a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble.\r\nStir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked.\r\nTip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice.",
  "description": "A fragrant Thai dish made with coconut milk, green curry paste, and a mix of vegetables and meat or seafood.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Thai%20Green%20Curry.jpg",
  "time": "40",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e3746",
      "measure": "225g new"
    },
    {
      "id": "640c2dd963a319ea671e36f1",
      "measure": "100g "
    },
    {
      "id": "640c2dd963a319ea671e3776",
      "measure": "1 tbsp"
    },
    {
      "id": "640c2dd963a319ea671e36e3",
      "measure": "1 clove"
    },
    {
      "id": "640c2dd963a319ea671e377a",
      "measure": "4 tsp "
    },
    {
      "id": "640c2dd963a319ea671e36ab",
      "measure": "400ml"
    },
    {
      "id": "640c2dd963a319ea671e3779",
      "measure": "2 tsp"
    },
    {
      "id": "640c2dd963a319ea671e3774",
      "measure": "1 tsp"
    },
    {
      "id": "640c2dd963a319ea671e365b",
      "measure": "450g boneless"
    },
    {
      "id": "640c2dd963a319ea671e3716",
      "measure": "2 fresh kaffir leaves"
    },
    {
      "id": "640c2dd963a319ea671e3667",
      "measure": "handfull"
    },
    {
      "id": "640c2dd963a319ea671e3753",
      "measure": "Boiled"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733241"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1681502548085"
    }
  }
},{
  "_id": {
    "$oid": "6462a8f74c3d0ddd28898047"
  },
  "title": "Traditional Croatian Goulash",
  "category": "Beef",
   "owner": {
    "$oid": "64c8d958249fae54bae90bb9"
  },
  "area": "Croatian",
  "instructions": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour\r\nHeat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot\r\nCut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster\r\nOnce the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid\r\nCover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes\r\nAllow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors",
  "description": "A hearty Croatian stew made with beef, potatoes, onions, and paprika, often served with a side of bread or pasta. The dish has a rich and savory flavor and is a popular comfort food in Croatia.",
  "thumb": "https://ftp.goit.study/img/so-yummy/preview/Traditional%20Croatian%20Goulash.jpg",
  "time": "135",
  "ingredients": [
    {
      "id": "640c2dd963a319ea671e365d",
      "measure": "500g"
    },
    {
      "id": "640c2dd963a319ea671e372e",
      "measure": "2 chopped"
    },
    {
      "id": "640c2dd963a319ea671e3684",
      "measure": "2 chopped"
    },
    {
      "id": "640c2dd963a319ea671e36e3",
      "measure": "2 cloves"
    },
    {
      "id": "640c2dd963a319ea671e366a",
      "measure": "2"
    },
    {
      "id": "640c2dd963a319ea671e3751",
      "measure": "200ml"
    },
    {
      "id": "640c2dd963a319ea671e378f",
      "measure": "2 Litres"
    },
    {
      "id": "640c2dd963a319ea671e3727",
      "measure": "3 tbs"
    },
    {
      "id": "640c2dd963a319ea671e375e",
      "measure": "1tbsp"
    },
    {
      "id": "640c2dd963a319ea671e373f",
      "measure": "1/2 tsp"
    },
    {
      "id": "640c2dd963a319ea671e3733",
      "measure": "1/2 tsp"
    },
    {
      "id": "640c2dd963a319ea671e3789",
      "measure": "2 tbs"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1678562733248"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1681502548085"
    }
  }
}]